[
    {
        "image" : "1200.jpg",
        "date" : "22/05/2025",
        "headline" : "*** Next Mid Essex Show - 15th June ***",
        "content" : "<p><b>Get ready for an electrifying night of action!</b> Join us at Witham on 15th June 2025 for our next thrilling home boxing show, featuring all out most talented boxers. Experience the excitement ringside as talented local fighters go toe-to-toe in a series of adrenaline-pumping bouts.</p><p>Whether you're a boxing enthusiast or just looking for a great night out, this is an event you won't want to miss. Mark your calendars and come support our rising stars—see you at Witham Boxing Gym!</p>"
    },
    {
        "image" : "3100.jpg",
        "date" : "25/05/2025",
        "headline" : "Ollie Wins First Bout",
        "content" : "<p>On Sunday, we had the pleasure of watching Oliver take to the ring at the Thetford Town Boxing Club show. Demonstrating impressive composure and technique, Ollie skillfully controlled the action behind a sharp, accurate jab, seizing every opportunity to unleash a powerful right hand. His ability to dictate the pace and maintain dominance throughout the bout was remarkable, especially for someone making their debut appearance. Ollie showcased maturity and ring intelligence well beyond his years and experience, earning well-deserved praise from both coaches and spectators. Congratulations to Ollie on a fantastic performance—this is just the beginning, and there are many more victories ahead!</p>"
    },
    {
        "image" : "1600.jpg",
        "date" : "18/05/2025",
        "headline" : "Radley Unlucky in Close Bout",
        "content" : "<p>The Bomber returned to action this evening, competing away on the Felixstowe show. Radley made an impressive start, forcing a count on his awkward southpaw opponent early in the first round. As the fight progressed, his opponent found his rhythm and likely edged the second round. With everything to fight for in the third, it was a closely contested bout right to the final bell. Ultimately, the decision went against Radley in a narrow 3-2 split, but he gave a strong account of himself and will be back in action soon.</p>"
    },
    {
        "image" : "1300.jpg",
        "date" : "18/05/2025",
        "headline" : "Strong Performance From Bayley",
        "content" : "<p>Bayley delivered an impressive performance on the Prince Regent show, securing a unanimous decision victory against a tough opponent. Although it was challenging to keep the shorter, powerful adversary at bay, Bayley showed great composure and skill, maintaining control throughout the fight and earning a well-deserved win. It's fantastic to see the progress Bayley has made in recent weeks, and we look forward to watching him back in action next week.</p?"
    },
    {
        "image" : "1400.jpg",
        "date" : "18/05/2025",
        "headline" : "Kenny Loses Split Decision",
        "content" : "<p>On a busy Friday evening for Mid Essex boxers, Kenny took to the ring on the Hornchurch and Elmpark show. The home crowd's support made for a lively atmosphere during a tightly contested opening round. Undeterred, Kenny came out firing in the second, dominating the action and showcasing a wide range of impressive skills. The third round was one of the most exciting we've seen all year, and we believed Kenny had done enough to secure the win. However, the split decision narrowly went the other way.</P> <p>There's no time to dwell on the result, though—Kenny will be back in action again next week.</p>"
    },
        {
        "image" : "8600.jpg",
        "date" : "10/05/2025",
        "headline" : "Elin and Tommy at National Championships",
        "content" : "<p>Today, Elin and Tommy proudly represented Mid Essex at the England Schools National Championships in Newcastle. First up was Tommy, facing an exceptionally strong opponent who was the tournament favourite. Tommy began confidently, using his jab to try and keep his opponent at range, but the challenger's strength soon proved decisive, especially when forcing Tommy against the ropes. Despite putting up a valiant effort, Tommy was stopped in the third round.</p><p>Next, Elin stepped into the ring against a familiar rival she had faced in each of the previous two years. Early on, ring rust was apparent as Elin took time to settle into the contest. However, she found her rhythm in the second round, pressing forward and landing effective straight punches. Fatigue set in during the final round, and Elin eventually lost by decision.</p><p>Everyone at Mid Essex is extremely proud of both boxers. We know they will grow from this valuable experience and come back even stronger next year.</p>"
    },
        {
        "image" : "8700.jpg",
        "date" : "20/04/2025",
        "headline" : "Luca Misses Out in Eastern Counties Final",
        "content" : "In one of the day's most exciting bouts, Luca narrowly missed out in the Eastern Counties Schools final. The opening round saw Luca perform superbly, landing the cleaner shots and controlling the action. Round two remained close, but his opponent began to find his timing on the way in, connecting with some well-placed punches. Heading into the third round, everything was still to fight for. However, a moment of controversy shifted the momentum: Luca was given a standing eight count after absorbing only a glancing blow, even as he simultaneously landed a strong left hook of his own. With that, Luca threw caution to the wind in the final moments, but was ultimately unable to reverse the outcome."
    }
]